In [15]:
# imports and froms
import pandas as pd
import pymysql
from sqlalchemy import create_engine
pymysql.install_as_MySQLdb()

In [16]:
# load CSVs into dataframes
income_csv = 'income.csv'
income_df = pd.read_csv(income_csv, encoding = 'utf8')
income_df.head()

,State,State In.,City,Average Income,Median Income,Population,Median Housing Price,Data Scientist Average Salary,Data Engineer Average Salary,Unnamed: 9,Data Analyst Average Salary,Statistician Average Salary,Data & Analytics Manager Average Salary
0,California,CA,San Francisco,"$100,856.92","$84,786.00","884,000","$1,357,000.00","$130,000.00","$120,000.00",San Francisco,"$80,000.00","$92,500.00","$130,000.00"
1,California,CA,San Diego,"$84,908.78","$75,188.00","1,420,000","$633,600.00","$115,000.00","$97,400.00",San Diego,"$60,000.00","$85,900.00","$122,000.00"
2,California,CA,Los Angeles,"$61,724.56","$39,202.50","4,000,000","$686,100.00","$115,000.00","$107,000.00",Los Angeles,"$65,000.00","$81,000.00","$107,000.00"
3,New York,NY,New York,"$88,873.63","$68,128.00","8,600,000","$677,000.00","$110,000.00","$105,000.00",New York,"$65,000.00","$90,000.00","$108,000.00"
4,Massachusetts,MA,Boston,"$78,482.50","$51,575.00","685,000","$599,000.00","$106,000.00","$90,000.00",Boston,"$64,000.00","$70,000.00","$104,000.00"

In [14]:
# income_df.drop(['id', 'State_Code', 'County', 'Place', 'Primary', 'Area_Code', 'ALand', 'AWater'], axis=1)

In [4]:
host = '127.0.0.1' 
user = 'root'
password = 'Bacon0531'
db = 'income_db'
charset = 'utf8'
port = 3306
cursorclass = pymysql.cursors.DictCursor

In [5]:
connection = pymysql.connect(
    host=host,
    user=user,
    password=password,
    charset=charset,
    cursorclass=cursorclass)
cursor_object = connection.cursor()

In [6]:
# create database
sql_create = (f'CREATE DATABASE IF NOT EXISTS {db}')  
cursor_object.execute(sql_create)

# show databases
sql_query = 'SHOW DATABASES'
cursor_object.execute(sql_query)
db_list = cursor_object.fetchall()

for database in db_list:
    print(database)

{'Database': 'etl_db'}
{'Database': 'income_db'}
{'Database': 'information_schema'}
{'Database': 'mysql'}
{'Database': 'performance_schema'}
{'Database': 'sys'}

/Users/mollyperlich/anaconda3/lib/python3.6/site-packages/pymysql/cursors.py:329: Warning: (1007, "Can't create database 'income_db'; database exists")
  self._do_get_result()

In [7]:
# reestablish pymysql connection with database specified
connection = pymysql.connect(
    host=host,
    user=user,
    password=password,
    db=db, 
    charset=charset,
    cursorclass=cursorclass)
cursor_object = connection.cursor()

In [8]:
# create tables
query_list = [
    'CREATE TABLE IF NOT EXISTS cities(City VARCHAR(32), State VARCHAR(32), Mean INT, Median INT)'
]

for query in query_list:
    cursor_object.execute(query)

# show tables
sql_query = 'SHOW TABLES'   
cursor_object.execute(sql_query)
rows = cursor_object.fetchall()

for row in rows:
    print(row)

{'Tables_in_income_db': 'cities'}

/Users/mollyperlich/anaconda3/lib/python3.6/site-packages/pymysql/cursors.py:329: Warning: (1050, "Table 'cities' already exists")
  self._do_get_result()

In [9]:
# establish sqlalchemy connection
con = create_engine(f'mysql+pymysql://{user}:{password}@{host}:{port}/{db}?charset=utf8', echo=False)

# load data into tables
income_df.to_sql(name='cities', con=con, if_exists='replace', index=False)

NameError: name 'income_df' is not defined

In [10]:
# reestablish pymysql connection after loading data
connection = pymysql.connect(
    host=host,
    user=user,
    password=password,
    db=db, 
    charset=charset,
    cursorclass=cursorclass)
cursor_object = connection.cursor()

# # show data in tables
# query_list = [
#     'SELECT * FROM cities LIMIT 10',
# ]

# for query in query_list:
#     cursor_object.execute(query)
#     rows = cursor_object.fetchall()

#     for row in rows:
#         print(row)
        
#     print(end='\n')

In [11]:
# terminate pymysql connection
connection.close()